
{"categories":{"PVP":["getArenaTeam"],"Characters":["getCharacter"],"Data":["getCharacterClasses","getCharacterRaces","getGuildPerks","getGuildRewards","getItemClasses"],"Guilds":["getGuild"],"Items":["getItem"],"Auctions":["getRealmAuctions"],"Realms":["getRealmsStatus"]},"getArenaTeam":{"doc":"Provides detailed arena team information.","params":{"realm":{"doc":"The realm name."},"teamSize":{"doc":"The team size."},"teamName":{"doc":"The team name."}}},"getCharacter":{"doc":"Fetches a single character at a time through an HTTP GET request to a URL describing the character profile resource. By default, a basic dataset will be returned and with each request and zero or more additional fields can be retrieved. The core dataset returned includes the character's realm, name, level, last modified timestamp, thumbnail, race id, achievement points value, gender id and class id.","params":{"realm":{"doc":"The realm name."},"characterName":{"doc":"The character name."},"fields":{"doc":"Indicates that one or more of the optional datasets is to be retrieved. The list of the optional fields that can be requested:- guild: A summary of the guild that the character belongs to. If the character does not belong to a guild and this field is requested, this field will not be exposed.- stats: A map of character attributes and stats.- talents: A list of talent structures.- items: A list of items equipted by the character. Use of this field will also include the average item level and average item level equipped for the character.- reputation: A list of the factions that the character has an associated reputation with.- titles: A list of the titles obtained by the character including the currently selected title.- professions: A list of the character's professions. It is important to note that when this information is retrieved, it will also include the known recipes of each of the listed professions.- appearance: A map of values that describes the face, features and helm/cloak display preferences and attributes.- companions: A list of all of the non-combat pets obtained by the character.- mounts: A list of all of the mounts obtained by the character.- pets: A list of all of the combat pets obtained by the character.- achievements: A map of achievement data including completion timestamps and criteria information.- progression: A list of raids and bosses indicating raid progression and completedness.- pvp: A map of pvp information including arena team membership and rated battlegrounds information.- quests: A list of quests completed by the character."}}},"getCharacterClasses":{"doc":"Provides a list of character classes."},"getCharacterRaces":{"doc":"Provides a list of character races."},"getGuild":{"doc":"Fetches a single guild at a time through an HTTP GET request to a url describing the guild profile resource. By default, a basic dataset will be returned and with each request and zero or more additional fields can be retrieved. The core dataset returned includes the guild's name, level, faction and achievement points.","params":{"realm":{"doc":"The realm name."},"guildName":{"doc":"The guild name."},"fields":{"doc":"Indicates that one or more of the optional datasets is to be retrieved. The list of the optional fields that can be requested:- members: A list of characters that are a member of the guild.- achievements: A set of data structures that describe the achievements earned by the guild."}}},"getGuildPerks":{"doc":"Provides a list of all guild perks."},"getGuildRewards":{"doc":"Provides a list of all guild rewards."},"getItem":{"doc":"Provides detailed item information.","params":{"itemId":{"doc":"The item ID."}}},"getItemClasses":{"doc":"Provides a list of item classes."},"getRealmAuctions":{"doc":"Provides a per-realm list of recently generated auction house data dumps. The current auctions data is represented as JSON structures containing auction data for the tree auctions houses available on each realm.","params":{"realm":{"doc":"The realm name."}}},"getRealmsStatus":{"doc":"Retrieves realms status information. This information is limited to whether or not the realm is up, the type and state of the realm and the current population."}}
