
{"categories":{"Freebase":["image","mqlread","mqlwrite","search","text","topic"]},"image":{"doc":"Get representative thumbnail images for entities.","params":{"id":{"doc":"The id of an entity for which you want an image. Alternatively, you may pass the id of the content node for a specific image."},"fallbackid":{"doc":"Use the image associated with this secondary id if no image is associated with the primary id."},"maxheight":{"doc":"Maximum height in pixels for resulting image. (integer 0 - 4,096)"},"maxwidth":{"doc":"Maximum width in pixels for resulting image. (integer 0 - 4,096)"},"mode":{"doc":"Method used to scale or crop image."},"pad":{"doc":"Whether the resulting image should be padded up to the requested dimensions. (boolean as 0 or 1)"}}},"mqlread":{"doc":"Retrieve detailed structured data about entities or collections of entities using the Metaweb Query Language (MQL).","params":{"query":{"doc":"A valid MQL query in the json format."},"as_of_time":{"doc":"Run the query as it would've been run at the specified point in time. Must be a valid timestamp (e.g. \"2007-01-09T22\" or \"2007-02\")."},"callback":{"doc":"JS method name for JSONP callbacks."},"cursor":{"doc":"Provides a mechanism for \"paging\" out results (can be used in conjunction with \"limit\" directive in MQL). No value (for the first request) OR a valid cursor returned by a previous request."},"html_escape":{"doc":"Whether or not to escape entities."},"indent":{"doc":"How many spaces to indent the JSON. (integer 0-10)"},"lang":{"doc":"Return strings in the language requested (if a given object has no name in the requested language, null will be returned)."},"cost":{"doc":"Whether or not to show the costs."},"uniqueness_failure":{"doc":"How MQL responds to uniqueness failures."}}},"mqlwrite":{"doc":"Perform insertions, deletions and updates of Metaweb Query Language (MQL).","params":{"query":{"doc":"A valid MQL query in the json format."}}},"search":{"doc":"Find entities by keyword search.","params":{"query":{"doc":"The text you want to match against freebase entities."},"callback":{"doc":"JS method name for JSONP callbacks."},"domain":{"doc":"A comma separated list of domain IDs. Search results must include these domains."},"exact":{"doc":"Matches only the name, and keys 'exactly'. No normalization of any kind is done at indexing and query time. The text is only broken up on space characters."},"filter":{"doc":"A Filter s-expression."},"format":{"doc":"The keyword \"classic\" to return the same information the original search API would have"},"html_escape":{"doc":"Whether or not to escape entities."},"indent":{"doc":"Whether to indent the json."},"limit":{"doc":"Return up to this number of results. (integer >= 1)"},"mql_output":{"doc":"A MQL query thats extracts entity information."},"prefixed":{"doc":"Whether or not to match by name prefix (used for autosuggest)."},"start":{"doc":"Allows paging through results. (integer >= 0)"},"type":{"doc":"A comma seperated list of type IDs. Search results must include these types."},"lang":{"doc":"The language you are searching in. Can pass multiple languages."}}},"text":{"doc":"Get short textual descriptions for entities.","params":{"id":{"doc":"The id of the entity that you want a description for."},"format":{"doc":"Sanitizing transformation."},"lang":{"doc":"The desired language of the content."},"maxlength":{"doc":"The max number of characters to return. Valid only for 'plain' format. (integer 0-4,294,967,295)"}}},"topic":{"doc":"The Freebase Topic API is a web service that will return all the known facts for a given topic including images and text blurbs.","params":{"id":{"doc":"The id of the entity that you want a description for."},"lang":{"doc":"The desired language of the content."},"filter":{"doc":"Specific types or properties which you want to return values for."},"limit":{"doc":"The maximum number of property values to return."}}}}
